brew "btop"
brew "poetry"
brew "sing-box"
brew "tmux"
brew "mole"
brew "font-meslo-lg-nerd-font"
brew "StanMarek/tap/ghost-complete"
brew "k9s"
brew "helix"

cask "aerospace"
cask "fork"
cask "raycast"
cask "spotify"
cask "telegram"
cask "visual-studio-code"
cask "cursor"
cask "obsidian"
cask "mitmproxy"
cask "chatgpt"

